import {
  BriefAboutContent,
  BriefAboutWrapper,
  BriefAboutTitle,
  BriefAboutText,
} from './BriefAbout.styles';

export default function BriefAbout() {
  return (
    <BriefAboutWrapper>
      <BriefAboutContent>
        <BriefAboutTitle>Про мене</BriefAboutTitle>
        <BriefAboutText>
          🥊 Зустрічайте Віктора Дорошенка (молодший) - професійного боксера та
          надзвичайно талановитого тренера! <br /> 🥊 Віктор - це не просто
          чемпіон в ринзі, це також досвідчений наставник, який вкладає свою
          душу в навчання наступного покоління боксерів. Він використовує свої
          роки досвіду в професійному боксі, щоб навчити вас технікам,
          стратегіям і вправам, які зроблять вас кращим боксером. Віктор
          розуміє, що бокс - це більше, ніж просто фізична форма. Це також
          спосіб мислення. Його тренування зосереджені на тому, щоб розвивати не
          тільки ваші фізичні здібності, але й ментальну витривалість, потрібну
          для виграшу. З Віктором ви будете не просто вчитися боксувати - ви
          будете вчитися бути чемпіоном. Він зосереджений на тому, щоб кожен
          його учень відчував себе впевнено, витривалим і готовим до будь-якого
          виклику. Не пропустіть цю унікальну можливість навчатися від
          професійного боксера та відданого тренера. Віктор Дорошенко чекає на
          вас в ринзі. Приєднуйтесь до його тренувань вже сьогодні, і почніть
          свій шлях до успіху в боксі.
        </BriefAboutText>
      </BriefAboutContent>
    </BriefAboutWrapper>
  );
}
