import {
  MotivationTextWrapper,
  MotivationTextTitle,
  MotivationTexts,
  MotivationTextContent,
} from './MotivationText.styles';

export default function MotivationText() {
  return (
    <MotivationTextWrapper>
      <MotivationTextContent>
        <MotivationTextTitle>Про бокс</MotivationTextTitle>
        <MotivationTexts>
          Бокс - це не просто спорт, це спосіб життя, який вимагає великої
          відданості, дисципліни та витримки. Він є одним з найбільш вимогливих
          видів спорту, але в той же час надзвичайно винагороджує своїх
          практикантів. Заняття боксом допомагають розвивати фізичну форму, а
          також покращують координацію, рівновагу та гнучкість. Але це ще не
          все. Цей вид спорту також стимулює ментальну гостроту, вивчаючи
          стратегії, розуміючи суперника та адаптуючись до непередбачуваних
          обставин. <br />
          Бокс - це не просто про фізичну силу, це також про розумову гостроту,
          стратегічне мислення та силу волі. Він вчить нас, як впоратися з
          викликами, стояти під тиском і витримувати удари, як буквально, так і
          переносно. Всі ці навички не лише корисні в рингу, але й в житті. Чи
          це боротьба з особистими демонами, викликами на роботі або невдачами в
          особистому житті, бокс дає нам інструменти для боротьби і
          витривалості. <br />
          Тому не зважайте на те, хто ви є зараз, бокс може зробити вас
          сильнішим, мудрішим, впевненим у собі. Візьміть в руки рукавички та
          відчуйте силу боксу!
        </MotivationTexts>
      </MotivationTextContent>
    </MotivationTextWrapper>
  );
}
