'use client';
import {
  AboutContainer,
  AboutTitle,
  AboutSubTitle,
  AboutImage,
  AboutText,
  AboutContent,
} from './About.styles';
import img1 from '../../assets/images/img1.jpeg';

export default function About() {
  return (
    <AboutContainer>
      <AboutTitle>Віктор Дорошенко</AboutTitle>
      <AboutContent>
        <AboutSubTitle>Біографія</AboutSubTitle>
        <AboutImage
          src={img1}
          alt="Віктор Дорошенко"
          height={300}
          width={300}
        />
        <AboutText>
          Віктор Дорошенко, народився в Києві, Україна, є відомим професійним
          боксером з кар`єрою, що триває більше ніж 15 років. З раннього віку
          Дорошенко проявляв вроджені таланти до спорту, вдосконалюючи свої
          навички через безперервну практику і непохитну відданість. Його шлях
          до професійного боксу не був простим, але це був шлях, який він обрав
          з переконанням і пристрастю.
          <br />
          Протягом років Дорошенко встановив себе як сильну фігуру в світі
          боксу. Його вражаючий рекорд є свідченням його майстерності,
          дисципліни та волі до перемоги. Він відомий своїми швидкими рухами
          ніг, точними ударами і стратегічним підходом до кожного матчу. Кожен
          бій - це демонстрація його майстерності, що залишає глядачів в
          захопленні від його таланту.
        </AboutText>
        <AboutText>
          Вплив Дорошенко виходить за рамки його власної професійної кар`єри.
          Він працював з видатними спортсменами, допомагаючи їм вдосконалювати
          свої техніки і стратегії. Як наставник, він терплячий та проникливий,
          ділячись своїми знаннями та досвідом з молодшим поколінням боксерів.
          Його відданість спорту видна не лише в його власному виступі, а й в
          його зобов`язанні до розвитку таланту в інших.
          <br />
          Його шлях, відзначений безліччю перемог та важкими уроками, говорить
          багато про його характер. Віктор Дорошенко стоїть як символ
          витривалості, наполегливості та нескінченного прагнення до від Віктор
          Дорошенко, народився в Києві, Україна, є відомим професійним боксером
          з кар`єрою, що триває більше ніж 15 років. З раннього віку Дорошенко
          проявляв вроджені таланти до спорту, вдосконалюючи свої навички через
          безперервну практику і непохитну відданість. Його шлях до професійного
          боксу не був простим, але це був шлях, який він обрав з переконанням і
          пристрастю.
        </AboutText>
      </AboutContent>
    </AboutContainer>
  );
}
