export type CommentType = {
  id: number;
  name: string;
  comment: string;
  date: string;
};

export const comments: CommentType[] = [
  {
    id: 1,
    name: 'Борис',
    comment: 'Перший день занять, дуже сподобалось',
    date: '2023-07-11',
  },
  {
    id: 2,
    name: 'Володимир',
    comment: 'Дуже прикольний тренер',
    date: '2023-07-16',
  },
  {
    id: 3,
    name: 'Артем',
    comment: 'Хочу бути таким же як Майк Тайсон',
    date: '2023-07-15',
  },
  {
    id: 4,
    name: 'Міша',
    comment: '2 роки працюю з цим тренером, дуже задоволений',
    date: '2023-07-14',
  },
  {
    id: 5,
    name: 'Оля',
    comment:
      'Віддала дітей на тренування, дуже задоволена, діти вже 2 роки ходять',
    date: '2023-07-11',
  },
  {
    id: 6,
    name: 'Віктор',
    comment: 'Хожу вже півроку, удар поставлений чітко, рекомендую',
    date: '2023-07-12',
  },
  {
    id: 7,
    name: 'Сергій',
    comment: 'Я вже 10 років тренуюся, дуже задоволений, рекомендую',
    date: '2023-07-13',
  },
];
