export type dataTextType = {
  text: string;
  name: string;
};

export const dataText: dataTextType[] = [
  {
    text: 'Я - найвеличніший, я сказав це навіть до того, як знав, що ним стану.',
    name: 'Мухаммед Алі',
  },
  {
    text: `Кожен має план, поки не отримає удар в обличчя.`,
    name: 'Майк Тайсон',
  },
  {
    text: `Бокс - це спорт, де ви ніколи не використовуєте пристрасть. Ви використовуєте навички.`,
    name: 'Джордж Форман',
  },
  {
    text: `Бокс - це реальний тест для людини. Це той вид спорту, де ви не можете отримати нічого без підготовки.`,
    name: 'Флоїд Мейвезер',
  },
  {
    text: ` Є дві речі, які ви може зробити, коли ви встаєте на ринг - бути впевненим і бути готовим`,
    name: 'Оскар Де Ла Хойя',
  },
  {
    text: `Я люблю бокс. Бокс - це джерело моєго щастя.`,
    name: 'Менні Пак`яо',
  },
  {
    text: `Все, що я роблю, я роблю з повною віддачею. Це моє життя, і я присвятив його боксу.`,
    name: 'Флойд Мейвезер',
  },
  {
    text: 'Коли я вийшов на ринг, то ніколи не думав про те, щоб нокаутувати суперника. Моя мета - бути кращим.',
    name: 'Сахат Пічінчай aka Сахат Чайчана чи Сомлак Камсінг',
  },
  {
    text: 'Я знаю, що я вже ніколи не буду таким молодим, але я завжди буду твердо стояти на ногах і битися до самого кінця.',
    name: 'Джордж Форман',
  },
  {
    text: 'Бокс для мене - це не просто спорт. Це спосіб життя.',
    name: 'Менні Пакʼяо',
  },
  {
    text: 'Для мене бокс - це більше, ніж просто бій. Це шанс показати світові, хто я є.',
    name: 'Володимир Кличко',
  },
];
